# LAB 2.9 | SQL - PYTHON

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

#### 1. How many distinct (different) actors' last names are there?

In [8]:
data = pd.read_sql_query('''select count(distinct last_name) as distinct_last_names 
from sakila.actor''', engine)
data

   distinct_last_names
0                  121

#### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [14]:
data = engine.execute('''SELECT rental_date, EXTRACT(MONTH FROM rental_date), 
WEEKDAY(rental_date), 
CASE 
WHEN WEEKDAY(rental_date) = 0 OR WEEKDAY(rental_date) = 6 THEN 'weekend' 
ELSE 'workday'   
END AS day_type
FROM sakila.rental;''')

rows = []
for row in data:
    rows.append(row)
    
pd.DataFrame(rows)

                        0  1  2        3
0     2005-05-24 22:53:30  5  1  workday
1     2005-05-24 22:54:33  5  1  workday
2     2005-05-24 23:03:39  5  1  workday
3     2005-05-24 23:04:41  5  1  workday
4     2005-05-24 23:05:21  5  1  workday
...                   ... .. ..      ...
16039 2006-02-14 15:16:03  2  1  workday
16040 2006-02-14 15:16:03  2  1  workday
16041 2006-02-14 15:16:03  2  1  workday
16042 2006-02-14 15:16:03  2  1  workday
16043 2006-02-14 15:16:03  2  1  workday

[16044 rows x 4 columns]

In [15]:
##### why are there no column names?

In [17]:
query = '''SELECT rental_date, EXTRACT(MONTH FROM rental_date) as month, 
WEEKDAY(rental_date) as day, 
CASE 
WHEN WEEKDAY(rental_date) = 0 OR WEEKDAY(rental_date) = 6 THEN 'weekend' 
ELSE 'workday'   
END AS day_type
FROM sakila.rental;'''

data = pd.read_sql_query(query, engine)
data

              rental_date  month  day day_type
0     2005-05-24 22:53:30      5    1  workday
1     2005-05-24 22:54:33      5    1  workday
2     2005-05-24 23:03:39      5    1  workday
3     2005-05-24 23:04:41      5    1  workday
4     2005-05-24 23:05:21      5    1  workday
...                   ...    ...  ...      ...
16039 2006-02-14 15:16:03      2    1  workday
16040 2006-02-14 15:16:03      2    1  workday
16041 2006-02-14 15:16:03      2    1  workday
16042 2006-02-14 15:16:03      2    1  workday
16043 2006-02-14 15:16:03      2    1  workday

[16044 rows x 4 columns]

#### 3. Get all films with ARMAGEDDON in the title.

In [32]:
query = 'SELECT film_id, title \
FROM sakila.film \
WHERE title LIKE "%%ARMAGEDDON%%"'

data = pd.read_sql_query(query, engine)
data

   film_id                  title
0       39        ARMAGEDDON LOST
1      507    LADYBUGS ARMAGEDDON
2      571       METAL ARMAGEDDON
3      598    MOSQUITO ARMAGEDDON
4      838  STAGECOACH ARMAGEDDON
5      844      STEERS ARMAGEDDON

#### 4. Get 10 the longest films.

In [37]:
query = "SELECT title FROM sakila.film \
        ORDER BY length DESC LIMIT 10"

data = pd.read_sql_query(query, engine)
data

                title
0      DARN FORRESTER
1        POND SEATTLE
2       CHICAGO NORTH
3       MUSCLE BRIGHT
4        WORST BANGER
5         GANGS PRIDE
6  SOLDIERS EVOLUTION
7           HOME PITY
8   SWEET BROTHERHOOD
9      CONTROL ANTHEM

#### 5. How many films include Behind the Scenes content?

In [41]:
query = """ SELECT title FROM film
WHERE special_features LIKE '%%Behind the Scenes%%' 
"""

data = pd.read_sql_query(query, engine)
data.head()

              title
0  ACADEMY DINOSAUR
1  AFFAIR PREJUDICE
2   ALAMO VIDEOTAPE
3       ALI FOREVER
4    ALICE FANTASIA

#### 6.  Which kind of movies (rating) have a mean duration of more than two hours?

In [44]:
query = """ SELECT ROUND(AVG(length)) as average_length, rating
FROM sakila.film
GROUP BY rating
HAVING AVG(length) > 120
"""

data = pd.read_sql_query(query, engine)
data

   average_length rating
0           120.0  PG-13

#### 7.  Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [46]:
query = """SELECT title, length, RANK()
OVER (ORDER BY length DESC) AS ranking
FROM sakila.film
WHERE length > 0 OR length IS NOT NULL;
"""

data = pd.read_sql_query(query, engine)
data

                   title  length  ranking
0          CHICAGO NORTH     185        1
1         CONTROL ANTHEM     185        1
2         DARN FORRESTER     185        1
3            GANGS PRIDE     185        1
4              HOME PITY     185        1
..                   ...     ...      ...
995         ALIEN CENTER      46      996
996            IRON MOON      46      996
997        KWAI HOMEWARD      46      996
998     LABYRINTH LEAGUE      46      996
999  RIDGEMONT SUBMARINE      46      996

[1000 rows x 3 columns]